In [80]:
import pandas as pd

# employee dataframe
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df1

  employee   department
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [81]:
df2 = pd.DataFrame({'department': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df2

    department supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [82]:
df3 = pd.merge(df1, df2)
df3

  employee   department supervisor
0      Bob   Accounting      Carly
1     Jake  Engineering      Guido
2     Lisa  Engineering      Guido
3      Sue           HR      Steve

In [83]:
df4 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df4

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [95]:
df5 = pd.merge(df3, df4, left_on='employee', right_on='name')
df5

  employee   department supervisor  name  salary
0      Bob   Accounting      Carly   Bob   70000
1     Jake  Engineering      Guido  Jake   80000
2     Lisa  Engineering      Guido  Lisa  120000
3      Sue           HR      Steve   Sue   90000

In [96]:
df5.drop("name", axis=1, inplace=True)
df5

  employee   department supervisor  salary
0      Bob   Accounting      Carly   70000
1     Jake  Engineering      Guido   80000
2     Lisa  Engineering      Guido  120000
3      Sue           HR      Steve   90000

In [86]:
df5 = df5.groupby('department')
df5

In [75]:
for group in list(df5):
    print(df5)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002C177AE9B88>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002C177AE9B88>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002C177AE9B88>

In [76]:
df5.salary.mean()

department
Accounting      70000
Engineering    100000
HR              90000
Name: salary, dtype: int64

In [77]:
def custom_func(group, ttl):
    print(group.mean())
    print(ttl)

In [78]:
df5.apply(custom_func, 75)

salary    70000.0
dtype: float64
75
salary    100000.0
dtype: float64
75
salary    90000.0
dtype: float64
75

Empty DataFrame
Columns: []
Index: []